scripts/redis/vm/output.txt
====== PING_INLINE ======
  100000 requests completed in 0.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.24% <= 1 milliseconds
99.69% <= 2 milliseconds
99.96% <= 3 milliseconds
99.97% <= 4 milliseconds
99.98% <= 5 milliseconds
99.99% <= 6 milliseconds
99.99% <= 11 milliseconds
100.00% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 18 milliseconds
131061.59 requests per second

====== PING_BULK ======
  100000 requests completed in 0.62 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.94% <= 1 milliseconds
99.98% <= 2 milliseconds
99.98% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
160000.00 requests per second

====== SET ======
  100000 requests completed in 0.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.92% <= 1 milliseconds
100.00% <= 1 milliseconds
151285.92 requests per second

====== GET ======
  100000 requests completed in 0.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.93% <= 1 milliseconds
100.00% <= 2 milliseconds
100.00% <= 3 milliseconds
100.00% <= 3 milliseconds
144927.53 requests per second

====== INCR ======
  100000 requests completed in 0.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.97% <= 1 milliseconds
99.99% <= 2 milliseconds
100.00% <= 3 milliseconds
100.00% <= 4 milliseconds
153139.36 requests per second

====== LPUSH ======
  100000 requests completed in 0.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.94% <= 1 milliseconds
99.99% <= 2 milliseconds
100.00% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 4 milliseconds
144508.67 requests per second

====== RPUSH ======
  100000 requests completed in 0.74 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.62% <= 1 milliseconds
99.91% <= 2 milliseconds
99.94% <= 3 milliseconds
99.95% <= 4 milliseconds
99.99% <= 6 milliseconds
100.00% <= 6 milliseconds
134589.50 requests per second

====== LPOP ======
  100000 requests completed in 0.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.97% <= 1 milliseconds
99.99% <= 2 milliseconds
100.00% <= 2 milliseconds
145560.41 requests per second

====== RPOP ======
  100000 requests completed in 0.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.91% <= 1 milliseconds
99.98% <= 3 milliseconds
100.00% <= 4 milliseconds
100.00% <= 4 milliseconds
145560.41 requests per second

====== SADD ======
  100000 requests completed in 0.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.88% <= 1 milliseconds
99.99% <= 2 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
151975.69 requests per second

====== HSET ======
  100000 requests completed in 0.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.99% <= 1 milliseconds
100.00% <= 1 milliseconds
145772.59 requests per second

====== SPOP ======
  100000 requests completed in 0.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.98% <= 1 milliseconds
100.00% <= 2 milliseconds
100.00% <= 2 milliseconds
157728.70 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 0.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.99% <= 1 milliseconds
100.00% <= 3 milliseconds
100.00% <= 4 milliseconds
147275.41 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 1.17 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.76% <= 1 milliseconds
100.00% <= 1 milliseconds
85106.38 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 2.22 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

67.96% <= 1 milliseconds
99.95% <= 2 milliseconds
100.00% <= 2 milliseconds
44964.03 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 2.89 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

42.38% <= 1 milliseconds
99.61% <= 2 milliseconds
99.95% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 4 milliseconds
34590.11 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 3.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

25.39% <= 1 milliseconds
97.30% <= 2 milliseconds
99.78% <= 3 milliseconds
100.00% <= 3 milliseconds
27397.26 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 0.88 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.78% <= 1 milliseconds
99.92% <= 2 milliseconds
99.92% <= 3 milliseconds
99.92% <= 4 milliseconds
99.93% <= 5 milliseconds
99.94% <= 8 milliseconds
99.96% <= 9 milliseconds
99.96% <= 12 milliseconds
99.97% <= 17 milliseconds
99.97% <= 18 milliseconds
99.98% <= 19 milliseconds
100.00% <= 20 milliseconds
100.00% <= 20 milliseconds
114155.25 requests per second